use bnmotor_icv_vehicle_fota;

-- 变更日期：2021-03-26
-- 变更人：许小常



-- 补充升级任务中车辆升级状态"升级任务失效"
ALTER TABLE `tb_fota_plan_obj_list` 
MODIFY COLUMN `status` tinyint(2) NOT NULL DEFAULT 0 COMMENT '升级状态:0=新创建,1=TBOX检测到新版本,2=TBOX已获取新版本结果下发信息（并已与OTA云端确认同步）,11=待下载(新版本信息已下发到TBOX),12=开始下载(并已与OTA云端确认同步),13=升级下载中,14=升级下载中止,15=升级下载等待,16=TBOX执行下载完成,17=TBOX执行下载完成(验证成功),18=TBOX执行下载完成(验证失败),31=待升级(TBOX端升级包已经下载成功，可以启动升级过程),32=开始升级(TBOX已收到升级安装指令,并已与OTA云端确认同步),33=前置条件检查失败,34=Hu端触发升级,35=取消升级,36=执行升级,37=升级完成成功,38=升级未完成,39=升级失败';